zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/samd51/atsamd51p19a-pinctrl.h
/* pc27h_tpiu_traceclk */
#define PC27H_TPIU_TRACECLK MCHP_PINMUX(c, 27, h, periph)

/* pc27n_ccl_in4 */
#define PC27N_CCL_IN4 MCHP_PINMUX(c, 27, n, periph)

/* pc28_gpio */
#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint12 */
#define PC28A_EIC_EXTINT12 MCHP_PINMUX(c, 28, a, periph)

/* pc28c_sercom1_pad1 */
#define PC28C_SERCOM1_PAD1 MCHP_PINMUX(c, 28, c, periph)

/* pc28h_tpiu_traced0 */
#define PC28H_TPIU_TRACED0 MCHP_PINMUX(c, 28, h, periph)

/* pc28n_ccl_in5 */
#define PC28N_CCL_IN5 MCHP_PINMUX(c, 28, n, periph)

/* pc30_gpio */
#define PC30_GPIO MCHP_PINMUX(c, 30, gpio, gpio)

/* pc30a_eic_extint14 */
#define PC30A_EIC_EXTINT14 MCHP_PINMUX(c, 30, a, periph)

/* pc30b_adc1_ain12 */
#define PC30B_ADC1_AIN12 MCHP_PINMUX(c, 30, b, periph)

/* pc31_gpio */
#define PC31_GPIO MCHP_PINMUX(c, 31, gpio, gpio)

/* pc31a_eic_extint15 */
#define PC31A_EIC_EXTINT15 MCHP_PINMUX(c, 31, a, periph)

/* pc31b_adc1_ain13 */
#define PC31B_ADC1_AIN13 MCHP_PINMUX(c, 31, b, periph)

/* pd0_gpio */
#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

/* pd0a_eic_extint0 */
#define PD0A_EIC_EXTINT0 MCHP_PINMUX(d, 0, a, periph)

/* pd0b_adc1_ain14 */
#define PD0B_ADC1_AIN14 MCHP_PINMUX(d, 0, b, periph)

/* pd1_gpio */
#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

/* pd1a_eic_extint1 */
#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

/* pd1b_adc1_ain15 */
#define PD1B_ADC1_AIN15 MCHP_PINMUX(d, 1, b, periph)

/* pd8_gpio */
#define PD8_GPIO MCHP_PINMUX(d, 8, gpio, gpio)

/* pd8a_eic_extint3 */
#define PD8A_EIC_EXTINT3 MCHP_PINMUX(d, 8, a, periph)

/* pd8c_sercom7_pad0 */
#define PD8C_SERCOM7_PAD0 MCHP_PINMUX(d, 8, c, periph)

/* pd8d_sercom6_pad1 */
#define PD8D_SERCOM6_PAD1 MCHP_PINMUX(d, 8, d, periph)

/* pd8f_tcc0_wo1 */
#define PD8F_TCC0_WO1 MCHP_PINMUX(d, 8, f, periph)

/* pd9_gpio */
#define PD9_GPIO MCHP_PINMUX(d, 9, gpio, gpio)

/* pd9a_eic_extint4 */
#define PD9A_EIC_EXTINT4 MCHP_PINMUX(d, 9, a, periph)

/* pd9c_sercom7_pad1 */
#define PD9C_SERCOM7_PAD1 MCHP_PINMUX(d, 9, c, periph)

/* pd9d_sercom6_pad0 */
#define PD9D_SERCOM6_PAD0 MCHP_PINMUX(d, 9, d, periph)

/* pd9f_tcc0_wo2 */
#define PD9F_TCC0_WO2 MCHP_PINMUX(d, 9, f, periph)

/* pd10_gpio */
#define PD10_GPIO MCHP_PINMUX(d, 10, gpio, gpio)

/* pd10a_eic_extint5 */
#define PD10A_EIC_EXTINT5 MCHP_PINMUX(d, 10, a, periph)

/* pd10c_sercom7_pad2 */
#define PD10C_SERCOM7_PAD2 MCHP_PINMUX(d, 10, c, periph)

/* pd10d_sercom6_pad2 */
#define PD10D_SERCOM6_PAD2 MCHP_PINMUX(d, 10, d, periph)

/* pd10f_tcc0_wo3 */
#define PD10F_TCC0_WO3 MCHP_PINMUX(d, 10, f, periph)

/* pd11_gpio */
#define PD11_GPIO MCHP_PINMUX(d, 11, gpio, gpio)

/* pd11a_eic_extint6 */
#define PD11A_EIC_EXTINT6 MCHP_PINMUX(d, 11, a, periph)

/* pd11c_sercom7_pad3 */
#define PD11C_SERCOM7_PAD3 MCHP_PINMUX(d, 11, c, periph)

/* pd11d_sercom6_pad3 */
#define PD11D_SERCOM6_PAD3 MCHP_PINMUX(d, 11, d, periph)

/* pd11f_tcc0_wo4 */
#define PD11F_TCC0_WO4 MCHP_PINMUX(d, 11, f, periph)

/* pd12_gpio */
#define PD12_GPIO MCHP_PINMUX(d, 12, gpio, gpio)

/* pd12a_eic_extint7 */
#define PD12A_EIC_EXTINT7 MCHP_PINMUX(d, 12, a, periph)

/* pd12f_tcc0_wo5 */
#define PD12F_TCC0_WO5 MCHP_PINMUX(d, 12, f, periph)

/* pd20_gpio */
#define PD20_GPIO MCHP_PINMUX(d, 20, gpio, gpio)

/* pd20a_eic_extint10 */
#define PD20A_EIC_EXTINT10 MCHP_PINMUX(d, 20, a, periph)

/* pd20c_sercom1_pad2 */
#define PD20C_SERCOM1_PAD2 MCHP_PINMUX(d, 20, c, periph)

/* pd20d_sercom3_pad2 */
#define PD20D_SERCOM3_PAD2 MCHP_PINMUX(d, 20, d, periph)

/* pd20f_tcc1_wo0 */
#define PD20F_TCC1_WO0 MCHP_PINMUX(d, 20, f, periph)

/* pd20i_sdhc1_sdcd */
#define PD20I_SDHC1_SDCD MCHP_PINMUX(d, 20, i, periph)

/* pd21_gpio */
#define PD21_GPIO MCHP_PINMUX(d, 21, gpio, gpio)

/* pd21a_eic_extint11 */
#define PD21A_EIC_EXTINT11 MCHP_PINMUX(d, 21, a, periph)

/* pd21c_sercom1_pad3 */
#define PD21C_SERCOM1_PAD3 MCHP_PINMUX(d, 21, c, periph)

/* pd21d_sercom3_pad3 */
#define PD21D_SERCOM3_PAD3 MCHP_PINMUX(d, 21, d, periph)

/* pd21f_tcc1_wo1 */
#define PD21F_TCC1_WO1 MCHP_PINMUX(d, 21, f, periph)

/* pd21i_sdhc1_sdwp */
#define PD21I_SDHC1_SDWP MCHP_PINMUX(d, 21, i, periph)

#endif /* MICROCHIP_ATSAMD51P19A_PINCTRL_H_ */
